In [5]:
from sklearn.preprocessing import LabelEncoder 
import pandas as pd
lbl_encoder = LabelEncoder()

In [6]:
df = pd.DataFrame({'colour': ['red', 'blue', 'green', 'green', 'red', 'blue']})

In [7]:
lbl_encoder.fit_transform(df[['colour']])

d:\dataAnalysis\python\venv\Lib\site-packages\sklearn\preprocessing\_label.py:110: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([2, 0, 1, 1, 2, 0])

In [8]:
lbl_encoder.transform([['red']])

d:\dataAnalysis\python\venv\Lib\site-packages\sklearn\preprocessing\_label.py:129: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([2])

In [9]:
## Ordinal Encoding
from sklearn.preprocessing import OrdinalEncoder

In [10]:
## Simple DataFrame 
df = pd.DataFrame({
    'size': ['small', 'medium', 'large', 'medium', 'small', 'large']
})

In [11]:
df

     size
0   small
1  medium
2   large
3  medium
4   small
5   large

In [12]:
## Instance of ordinal encoder 
encoder = OrdinalEncoder(categories=[['small', 'medium', 'large']])

In [13]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

In [14]:
encoder.transform([['large']])

d:\dataAnalysis\python\venv\Lib\site-packages\sklearn\utils\validation.py:2749: UserWarning: X does not have valid feature names, but OrdinalEncoder was fitted with feature names
  warnings.warn(

array([[2.]])

Target Guided Encoding

In [15]:
import pandas as pd 
df = pd.DataFrame({
    'city': ['newyork', 'london', 'paris', 'tokyo', 'newyork', 'paris'],
    'price': [200, 150,300, 250, 180, 320 ]
})

In [16]:
df

      city  price
0  newyork    200
1   london    150
2    paris    300
3    tokyo    250
4  newyork    180
5    paris    320

In [21]:
mean_price = df.groupby('city')['price'].mean().to_dict()

In [22]:
mean_price

{'london': 150.0, 'newyork': 190.0, 'paris': 310.0, 'tokyo': 250.0}

In [23]:
df['city_encoded'] = df['city'].map(mean_price)

In [24]:
df

      city  price  city_encoded
0  newyork    200         190.0
1   london    150         150.0
2    paris    300         310.0
3    tokyo    250         250.0
4  newyork    180         190.0
5    paris    320         310.0

In [25]:
df[['price', 'city_encoded']]

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         310.0
3    250         250.0
4    180         190.0
5    320         310.0

In [30]:
import seaborn as sns 
whole_df = sns.load_dataset('tips')

In [31]:
df = whole_df[['total_bill', 'time']]

In [32]:
df

     total_bill    time
0         16.99  Dinner
1         10.34  Dinner
2         21.01  Dinner
3         23.68  Dinner
4         24.59  Dinner
..          ...     ...
239       29.03  Dinner
240       27.18  Dinner
241       22.67  Dinner
242       17.82  Dinner
243       18.78  Dinner

[244 rows x 2 columns]

In [33]:
mean_price = df.groupby('time')['total_bill'].mean().to_dict()

C:\Users\ranji\AppData\Local\Temp\ipykernel_14064\927007832.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  mean_price = df.groupby('time')['total_bill'].mean().to_dict()

In [34]:
mean_price

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}